# AIT580 Assignment 5 - Python/Pandas for Data Analysis
###### ---------------------------------------------------------------------------------------
##### Purpose for GMU-AIT students to learn Python/Pandas for Data Science
##### The template created by Dr. Liao (6/5/2020)
###### ---------------------------------------------------------------------------------------
##### Student ID: 
##### Student's Full Name: John Gullette, Karyna Todd, Rebeca Conn 
##### Submission Date: 09/12/2021 
###### ---------------------------------------------------------------------------------------

#### Import Pandas package

In [1]:
import pandas as pd

#### Load CSV file and create the dataframe

In [6]:
file = "EmployeeAttrition.csv"
df = pd.read_csv(file)
df

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1465,36,No,Travel_Frequently,884,Research & Development,23,2,Medical,1,2061,...,3,80,1,17,3,3,5,2,0,3
1466,39,No,Travel_Rarely,613,Research & Development,6,1,Medical,1,2062,...,1,80,1,9,5,3,7,7,1,7
1467,27,No,Travel_Rarely,155,Research & Development,4,3,Life Sciences,1,2064,...,2,80,1,6,0,3,6,2,0,3
1468,49,No,Travel_Frequently,1023,Sales,2,3,Medical,1,2065,...,4,80,0,17,3,2,9,6,0,8
1469,34,No,Travel_Rarely,628,Research & Development,8,3,Medical,1,2068,...,1,80,0,6,3,4,4,3,1,2

#### 1 Count the total number of records in the table.

In [9]:
len(df)

1470

In [14]:
df.shape[0]

1470

#### 2 How many unique JOBROLE are there in the dataset.

In [20]:
df['JobRole'].nunique()

9

In [24]:
len(df['JobRole'].unique())

9

#### 3 Find EMPLOYEENUMBER, EDUCATIONFIELD, JOBROLE for all the employees whose AGE is greater than equal to 55 and ATTRITION is YES.

In [32]:
df[(df.Age >= 55) & (df.Attrition == 'Yes')][['EmployeeNumber', 'EducationField','JobRole']]

      EmployeeNumber    EducationField                    JobRole
122              161     Life Sciences         Research Scientist
126              165           Medical  Healthcare Representative
568              787           Medical                    Manager
595              825     Life Sciences          Research Director
608              842           Medical            Sales Executive
660              918     Life Sciences      Laboratory Technician
700              977  Technical Degree         Research Scientist
966             1360           Medical     Manufacturing Director
975             1372         Marketing            Sales Executive
1354            1907     Life Sciences      Laboratory Technician
1444            2032  Technical Degree      Laboratory Technician

#### 4 For each JOBROLE, find the average MONTHLYINCOME. Arrange the output in descending order.

In [38]:
df.groupby('JobRole').MonthlyIncome.mean().sort_values(ascending = False)

JobRole
Manager                      17181.676471
Research Director            16033.550000
Healthcare Representative     7528.763359
Manufacturing Director        7295.137931
Sales Executive               6924.279141
Human Resources               4235.750000
Research Scientist            3239.972603
Laboratory Technician         3237.169884
Sales Representative          2626.000000
Name: MonthlyIncome, dtype: float64

#### 5 Count the different MARITALSTATUS when ATTRITION is YES and AGE is greater than 35 in the dataset. Arrange the count in descending order.

In [53]:
df[(df.Attrition == 'Yes') & (df.Age > 35)].groupby('MaritalStatus').size().sort_values(ascending = False)

MaritalStatus
Married     33
Single      30
Divorced    14
dtype: int64

#### 6 For all the women employees having AGE between 55 and 60 and JOBLEVEL > 4, sort the DEPARTMENT from A to Z first and then EMPLOYEENUMBER in ascending order. Print only DEPARTMENT and EMPLOYEENUMBER in the output.

In [66]:
df[(df.Gender == 'Female') & (df.Age > 55) & (df.Age < 60) & (df.JobLevel > 4)][['Department','EmployeeNumber']].sort_values(by = ['Department','EmployeeNumber'])

                  Department  EmployeeNumber
105          Human Resources             140
851   Research & Development            1191
1009  Research & Development            1423

#### 7 What are the correlations between Education, JobSatisfaction, and HourlyRate?

In [68]:
df[['Education', 'JobSatisfaction', 'HourlyRate']].corr()

                 Education  JobSatisfaction  HourlyRate
Education         1.000000        -0.011296    0.016775
JobSatisfaction  -0.011296         1.000000   -0.071335
HourlyRate        0.016775        -0.071335    1.000000

#### 8 What can you find from the above correlation matrix? 
##### Please write one paragraph below:

From the above correlation matrix, we learn that education has a weak negative correlation with job satisfaction and a weak positive correlation with hourly rate. Additionally, job satisfaction has a weak negative coorelation with hourly rate. However, because of the relatively large data set size, the weak negative correlation between hourly rate and job satisfaction is signicant.